# c++学习笔记——15.虚表的存在、带虚函数的多重继承、继承的内存布局

### 1.虚表的存在

```c++
#include <stdio.h>
#include <iostream>

using std::cout;
using std::endl;

class Base
{
public:
    Base(double base)
    : _base(base)
    {
        cout << "Base(double)" << endl;
    }

    virtual 
    void f()
    {
        cout << "void Base::f()" << endl;
    }

    virtual 
    void g()
    {
        cout << "void Base::g()" << endl;
    }

    virtual 
    void h()
    {
        cout << "void Base::h()" << endl;
    }

    ~Base()
    {
        cout << "~Base()" << endl;
    }
private:
    double _base;
};

class Derived
: public Base
{
public:
    Derived(double base, double derived)
    : Base(base)
    , _derived(derived)
    {
        cout << "Derived(double, double)" << endl;
    }

    virtual 
    void f()
    {
        cout << "void Derived::f()" << endl;
    }

    virtual 
    void g()
    {
        cout << "void Derived::g()" << endl;
    }

    virtual 
    void h()
    {
        cout << "void Derived::h()" << endl;
    }

    ~Derived()
    {
        cout << "~Derived()" << endl;
    }
private:
    double _derived;
};

void test()
{
    cout << "sizeof(Derived) = " <<sizeof(Derived) << endl;

    cout << endl;
    //虚表是存在的,对于每一个含有虚函数的类来说，虚表是唯一的,虚表存在只读段
    Derived derived(10, 20);
    printf("派生类对象derived的地址: %p\n", &derived);
    printf("派生类对象derived的地址: %p\n", (long *)&derived);
    printf("派生类虚表的地址: %p\n", (long *)*(long *)&derived);
    printf("派生类第一个虚函数的地址: %p\n", (long *) *(long *)*(long *)&derived);


    cout << endl;
    typedef void (*pFun)();//函数指针
    pFun fun = (pFun)*((long *)*(long *)&derived);
    fun();
    printf("派生类第一个虚函数的地址: %p\n", fun);

    cout << endl;
    pFun fun1 = (pFun)*((long *)*(long *)&derived + 1);
    fun1();
    printf("派生类第二个虚函数的地址: %p\n", fun1);

    cout << endl;
    pFun fun2 = (pFun)*((long *)*(long *)&derived + 2);
    fun2();
    printf("派生类第三个虚函数的地址: %p\n", fun2);


    cout << endl << endl;

    Derived derived1(100, 200);
    printf("派生类对象derived1的地址: %p\n", &derived1);
    printf("派生类对象derived1的地址: %p\n", (long *)&derived1);
    printf("派生类虚表的地址: %p\n", (long *)*(long *)&derived1);
    printf("派生类第一个虚函数的地址: %p\n", (long *) *(long *)*(long *)&derived1);

    cout << endl;
    cout << "_base = " << (double )*((double *)&derived + 1) << endl;
    cout << "_derived = " << (double )*((double *)&derived + 2) << endl;

}
int main(int argc, char **argv)
{
    test();
    return 0;
}

```

### 2.带虚函数的多重继承

```c++
#include <stdio.h>
#include <iostream>

using std::cout;
using std::endl;

class A
{
public:
    virtual
    void a()
    {
        cout << "A::a()" << endl;
    }

    virtual
    void b()
    {
        cout << "A::b()" << endl;
    }

    virtual
    void c()
    {
        cout << "A::c()" << endl;
    }
};
class B
{
public:
    virtual
    void a()
    {
        cout << "B::a()" << endl;
    }

    virtual
    void b()
    {
        cout << "B::b()" << endl;
    }

    void c()
    {
        cout << "B::c()" << endl;
    }

    void d()
    {
        cout << "B::d()" << endl;
    }
};

class C
: public A
, public B
{
public:
    virtual
    void a()
    {
        cout << "C::a()" << endl;
    }

    void c()
    {
        cout << "C::c()" << endl;
    }

    void d()
    {
        cout << "C::d()" << endl;
    }

};

int main(int argc, char **argv)
{
    C c;
    printf("&c = %p\n", &c);

    cout << endl << endl;
    A *pa =  &c;
    printf("pa = %p\n", pa);
    pa->a();
    pa->b();
    pa->c();


    cout << endl << endl;
    B *pb = &c;
    printf("pb = %p\n", pb);
    pb->a();
    pb->b();
    pb->c();
    pb->d();


    cout << endl << endl;
    C *pc = &c;
    printf("pc = %p\n", pc);
    pc->a();
    /* pc->b();//error,体现二义性: */
    pc->A::b();
    pc->B::b();
    pc->c();
    pc->d();//隐藏B里面的d()
    return 0;
}

```

### 3.继承的内存布局（windows下x86平台）

**注意：虚基指针指向虚基类，虚函数指针指向虚表**

在多重继承中，派生类的构造函数与单继承下派生类构造函数相似，它必须负责该派生类所有基类构造函数以及对象成员（如果有的话）构造函数的调用。同时，
派生类的参数必须包含完成所有基类、对象成员以及派生类中新增数据成员初始化所需的参数。派生类构造函数执行顺序如下：
    （1）所有基类的构造函数，多个基类构造函数的执行顺序取决于定义派生类时所指定的顺序，与派生类构造函数中所定义的成员初始化列表的参数顺序无关；
    （2）对象成员的构造函数；
    （3）派生类本省的构造函数。
加上虚基类后，它的初始化在语法上与一般多继承的初始化是相同的，但在调用构造函数的顺序上有点差别。
    （1）**先调用虚基类构造函数，然后调用非虚基类的构造函数。**
    （2）当同一层有多个虚基类，按照他们的声明顺序调用它们的构造函数；
    （3）当虚基类是由非虚基类派生时，则先调用基类构造函数，再调用派生类构造函数。


1. 普通的继承、没有虚函数、没有虚继承。

   ```c++
   class A
   {
   public:
   	A() : _ia(10) {}
   	/*virtual*/
   	void f()
   	{
   		cout << "A::f()" << endl;
   	}
   private:
   	int _ia;
   };
   
   class B
   : /*virtual*/ public A
   {
   public:
   	B() : _ib(20) {}
   
   	void fb()
   	{
   		cout << "A::fb()" << endl;
   	}
   	/*virtual*/
   	void f()
   	{
   		cout << "B::f()" << endl;
   	}
   	/*virtual*/ 
   	void fb2()
   	{
   		cout << "B::fb2()" << endl;
   	}
   private:
   	int _ib;
   };
   ```

   ```c++
   2>class B	size(8)://_ia和_ib都是int,总共占8字节
   2>	+---
   2> 0	| +--- (base class A)//先生成基类对象
   2> 0	| | _ia
   2>	| +---
   2> 4	| _ib//再生成派生类对象的数据成员
   2>	+---
   ```

   

2. 单个虚继承、没有虚函数

   ```c++
   class A
   {
   public:
   	A() : _ia(10) {}
   	/*virtual*/
   	void f()
   	{
   		cout << "A::f()" << endl;
   	}
   private:
   	int _ia;
   };
   
   class B
   : virtual public A
   {
   public:
   	B() : _ib(20) {}
   
   	void fb()
   	{
   		cout << "A::fb()" << endl;
   	}
   	/*virtual*/
   	void f()
   	{
   		cout << "B::f()" << endl;
   	}
   	/*virtual*/ 
   	void fb2()
   	{
   		cout << "B::fb2()" << endl;
   	}
   private:
   	int _ib;
   };
   ```

   ```c++
   2>class B	size(12)://_ia和_ib都是int，加上一个虚基指针,总共占12字节
   2>	+---
   2> 0	| {vbptr}//虚基指针
   2> 4	| _ib
   2>	+---
   2>	+--- (virtual base A)//虚基类放在存储空间末尾(先存不变的后存共享的)
   2> 8	| _ia
   2>	+---
   2>
   2>B::$vbtable@://虚基表
   2> 0	| 0
   2> 1	| 8 (Bd(B+0)A)//偏移8指向虚基类
   //总结:普通继承，派生类新增虚函数直接放在基类虚表中；且基类布局在前面
   //1.如果派生类没有自己新增的虚函数，此时派生类对象不会产生虚函数指针
   //2.如果派生类拥有自己新增的虚函数，此时派生类对象就会产生自己本身的虚函数指针(指向新增的虚函数)，并且该虚函数指针位于派生类对象存储空间的开始位置
   ```

   

3. 单个虚继承，带虚函数

   ```c++
   class A
   {
   public:
   	A() : _ia(10) {}
   	virtual
   	void f()
   	{
   		cout << "A::f()" << endl;
   	}
   private:
   	int _ia;
   };
   
   class B
   : virtual public A
   {
   public:
   	B() : _ib(20) {}
   
   	void fb()
   	{
   		cout << "A::fb()" << endl;
   	}
   	virtual
   	void f()
   	{
   		cout << "B::f()" << endl;
   	}
   	/*virtual*/ 
   	void fb2()
   	{
   		cout << "B::fb2()" << endl;
   	}
   private:
   	int _ib;
   };
   ```

   ```c++
   class B	size(16)://_ia和_ib都是int，加上一个虚函数指针和虚基指针,总共占16字节
   2>	+---
   2> 0	| {vbptr}//虚基指针，派生类里存在的，指向虚基类
   2> 4	| _ib
   2>	+---
   2>	+--- (virtual base A)
   2> 8	| {vfptr}//虚函数指针，基类A中有虚函数即存在，指向虚表
   2>12	| _ia
   2>	+---
   2>
   2>B::$vbtable@://虚基表，存储虚基类的地址偏移
   2> 0	| 0
   2> 1	| 8 (Bd(B+0)A)
   2>
   2>B::$vftable@://虚表，存储虚函数的入口地址
   2>		| -8
   2> 0	| &B::f//将A::f覆盖了
   //   1.如果派生类没有自己新增的虚函数，此时派生类对象不会产生虚函数指针
   //   2.如果派生类拥有自己新增的虚函数，此时派生类对象就会产生自己本身的虚函数指针(指向新增的虚函数)，并且该虚函数指针位于派生类对象存储空间的开始位置
   ```

4. 单个虚继承，带虚函数，且派生类新增自己的虚函数

   ```c++
   class A
   {
   public:
   	A() : _ia(10) {}
   	virtual
   	void f()
   	{
   		cout << "A::f()" << endl;
   	}
   private:
   	int _ia;
   };
   
   class B
   : virtual public A
   {
   public:
   	B() : _ib(20) {}
   
   	void fb()
   	{
   		cout << "A::fb()" << endl;
   	}
   	virtual
   	void f()
   	{
   		cout << "B::f()" << endl;
   	}
   	virtual 
   	void fb2()
   	{
   		cout << "B::fb2()" << endl;
   	}
   private:
   	int _ib;
   };
   ```

   ```c++
   2>class B	size(20)://_ia和_ib都是int，加上两个虚函数指针和一个虚基指针,总共占20字节
   2>	+---
   2> 0	| {vfptr}//派生类B自己新增了虚函数，所以会产生一个虚函数指针
   2> 4	| {vbptr}//虚基指针，派生类B存在的，指向虚基类
   2> 8	| _ib
   2>	+---
   2>	+--- (virtual base A)
   2>12	| {vfptr}//虚函数指针，基类A存在虚函数即产生
   2>16	| _ia
   2>	+---
   2>
   2>B::$vftable@B@://派生类B虚函数指针指向的虚表
   2>		| &B_meta
   2>		|  0
   2> 0	| &B::fb2//派生类B自己定义的虚函数
   2>
   2>B::$vbtable@://虚基表，存储虚基类的地址偏移
   2> 0	| -4
   2> 1	| 8 (Bd(B+4)A)
   2>
   2>B::$vftable@A@://基类A虚函数指针指向的虚表(还是派生类中的唯一虚表)
   2>		| -12
   2> 0	| &B::f//本来是A::f，继承后被B::f覆盖了
   //总结：虚继承多一个虚基指针，如果派生类新增虚函数，则放在最前面；且基类布局放在最后面
   ```

5. 多重继承，没有虚继承，不带虚函数

   ```c++
   class Base1
   {
   public:
   	Base1() : _iBase1(10) {}
   	/*virtual*/ void f(){cout << "Base1::f()" << endl;}
   	/*virtual*/ void g(){cout << "Base1::g()" << endl;}
   	/*virtual*/ void h(){cout << "Base1::h()" << endl;}
   private:
   	int _iBase1;
   };
   class Base2
   {
   public:
   	Base2() : _iBase2(100) {}
   	/*virtual*/ void f(){cout << "Base2::f()" << endl;}
   	/*virtual*/ void g(){cout << "Base2::g()" << endl;}
   	/*virtual*/ void h(){cout << "Base2::h()" << endl;}
   private:
   	int _iBase2;
   };
   class Base3
   {
   public:
   	Base3() : _iBase3(1000) {}
   	/*virtual*/ void f(){cout << "Base3::f()" << endl;}
   	/*virtual*/ void g(){cout << "Base3::g()" << endl;}
   	/*virtual*/ void h(){cout << "Base3::h()" << endl;}
   private:
   	int _iBase3;
   };
   class Derived
   	: /*virtual*/ public Base1
   	, /*virtual*/ public Base2
   	, /*virtual*/ public Base3
   {
   public:
   	Derived() : _iDerived(10000) {}
   	void f(){cout << "Derived::f()" << endl;}
   	/*virtual*/ void g1(){cout << "Derived::g1()" << endl;}
   private:
   	int _iDerived;
   };
   ```

   ```c++
   1>class Derived	size(16)://3个基类的int数据和1个派生类的int，共16字节
   1>	+---
   1> 0	| +--- (base class Base1)//基类Base1
   1> 0	| | _iBase1
   1>	| +---
   1> 4	| +--- (base class Base2)//基类Base2
   1> 4	| | _iBase2
   1>	| +---
   1> 8	| +--- (base class Base3)//基类Base3
   1> 8	| | _iBase3
   1>	| +---
   1>12	| _iDerived//派生类的数据成员
   1>	+---
   ```

6. 多重继承，没有虚继承，带虚函数

   ```c++
   class Base1
   {
   public:
   	Base1() : _iBase1(10) {}
   	virtual void f(){cout << "Base1::f()" << endl;}
   	virtual void g(){cout << "Base1::g()" << endl;}
   	virtual void h(){cout << "Base1::h()" << endl;}
   private:
   	int _iBase1;
   };
   class Base2
   {
   public:
   	Base2() : _iBase2(100) {}
   	virtual void f(){cout << "Base2::f()" << endl;}
   	virtual void g(){cout << "Base2::g()" << endl;}
   	virtual void h(){cout << "Base2::h()" << endl;}
   private:
   	int _iBase2;
   };
   class Base3
   {
   public:
   	Base3() : _iBase3(1000) {}
   	virtual void f(){cout << "Base3::f()" << endl;}
   	virtual void g(){cout << "Base3::g()" << endl;}
   	virtual void h(){cout << "Base3::h()" << endl;}
   private:
   	int _iBase3;
   };
   class Derived
   	: /*virtual*/ public Base1
   	, /*virtual*/ public Base2
   	, /*virtual*/ public Base3
   {
   public:
   	Derived() : _iDerived(10000) {}
   	void f(){cout << "Derived::f()" << endl;}
   	virtual void g1(){cout << "Derived::g1()" << endl;}
   private:
   	int _iDerived;
   };
   ```

   ```c++
   1>class Derived	size(28)://3个虚函数指针和4个int，共占28字节
   1>	+---
   1> 0	| +--- (base class Base1)//基类Base1
   1> 0	| | {vfptr}//虚函数指针，继承自Base1
   1> 4	| | _iBase1
   1>		| +---
   1> 8	| +--- (base class Base2)//基类Base2
   1> 8	| | {vfptr}//虚函数指针，继承自Base2
   1>12	| | _iBase2
   1>		| +---
   1>16	| +--- (base class Base3)//基类Base3
   1>16	| | {vfptr}//虚函数指针，继承自Base3
   1>20	| | _iBase3
   1>		| +---
   1>24	| _iDerived
   1>	+---
   1>
   1>Derived::$vftable@Base1@:
   1>		| &Derived_meta
   1>		|  0
   1> 0	| &Derived::f//派生类对f重写了
   1> 1	| &Base1::g//Base1的g,没有重写
   1> 2	| &Base1::h//Base1的h,没有重写
   1> 3	| &Derived::g1//派生类自己的虚函数
   1>
   1>Derived::$vftable@Base2@:
   1>		| -8
   1> 0	| &thunk: this-=8; goto Derived::f//指向派生类重写的一个f
   1> 1	| &Base2::g//Base2的g,没有重写
   1> 2	| &Base2::h//Base2的h,没有重写
   1>
   1>Derived::$vftable@Base3@:
   1>		| -16
   1> 0	| &thunk: this-=16; goto Derived::f//指向派生类重写的一个f
   1> 1	| &Base3::g//Base3的g,没有重写
   1> 2	| &Base3::h//Base3的h,没有重写
   ```

7. 多重继承，带有虚继承，不带虚函数

   ```c++
   class Base1
   {
   public:
   	Base1() : _iBase1(10) {}
   	/*virtual*/ void f(){cout << "Base1::f()" << endl;}
   	/*virtual*/ void g(){cout << "Base1::g()" << endl;}
   	/*virtual*/ void h(){cout << "Base1::h()" << endl;}
   private:
   	int _iBase1;
   };
   class Base2
   {
   public:
   	Base2() : _iBase2(100) {}
   	/*virtual*/ void f(){cout << "Base2::f()" << endl;}
   	/*virtual*/ void g(){cout << "Base2::g()" << endl;}
   	/*virtual*/ void h(){cout << "Base2::h()" << endl;}
   private:
   	int _iBase2;
   };
   class Base3
   {
   public:
   	Base3() : _iBase3(1000) {}
   	/*virtual*/ void f(){cout << "Base3::f()" << endl;}
   	/*virtual*/ void g(){cout << "Base3::g()" << endl;}
   	/*virtual*/ void h(){cout << "Base3::h()" << endl;}
   private:
   	int _iBase3;
   };
   class Derived
   	: virtual public Base1
   	, virtual public Base2
   	, virtual public Base3
   {
   public:
   	Derived() : _iDerived(10000) {}
   	void f(){cout << "Derived::f()" << endl;}
   	/*virtual*/ void g1(){cout << "Derived::g1()" << endl;}
   private:
   	int _iDerived;
   };
   ```

   ```c++
   1>class Derived	size(20)://1个虚基指针和4个int,共20字节
   1>	+---
   1> 0	| {vbptr}//派生类的虚基指针指向虚基类
   1> 4	| _iDerived
   1>	+---
   1>	+--- (virtual base Base1)
   1> 8	| _iBase1
   1>	+---
   1>	+--- (virtual base Base2)
   1>12	| _iBase2
   1>	+---
   1>	+--- (virtual base Base3)
   1>16	| _iBase3
   1>	+---
   1>
   1>Derived::$vbtable@:
   1> 0	| 0
   1> 1	| 8 (Derivedd(Derived+0)Base1)
   1> 2	| 12 (Derivedd(Derived+0)Base2)
   1> 3	| 16 (Derivedd(Derived+0)Base3)
   ```

8. 多重继承，带有虚继承，带虚函数

   ```c++
   class Base1
   {
   public:
   	Base1() : _iBase1(10) {}
   	virtual void f(){cout << "Base1::f()" << endl;}
   	virtual void g(){cout << "Base1::g()" << endl;}
   	virtual void h(){cout << "Base1::h()" << endl;}
   private:
   	int _iBase1;
   };
   class Base2
   {
   public:
   	Base2() : _iBase2(100) {}
   	virtual void f(){cout << "Base2::f()" << endl;}
   	virtual void g(){cout << "Base2::g()" << endl;}
   	virtual void h(){cout << "Base2::h()" << endl;}
   private:
   	int _iBase2;
   };
   class Base3
   {
   public:
   	Base3() : _iBase3(1000) {}
   	virtual void f(){cout << "Base3::f()" << endl;}
   	virtual void g(){cout << "Base3::g()" << endl;}
   	virtual void h(){cout << "Base3::h()" << endl;}
   private:
   	int _iBase3;
   };
   class Derived
   	: virtual public Base1
   	, virtual public Base2
   	, virtual public Base3
   {
   public:
   	Derived() : _iDerived(10000) {}
   	void f(){cout << "Derived::f()" << endl;}
   	virtual void g1(){cout << "Derived::g1()" << endl;}
   private:
   	int _iDerived;
   };
   ```

   ```c++
   1>class Derived	size(36)://4个int和4个虚函数指针以及1个虚基指针
   1>	+---
   1> 0	| {vfptr}//派生类的虚函数指针
   1> 4	| {vbptr}//派生类的虚基指针
   1> 8	| _iDerived
   1>	+---
   1>	+--- (virtual base Base1)
   1>12	| {vfptr}//基类Base1的虚函数指针
   1>16	| _iBase1
   1>	+---
   1>	+--- (virtual base Base2)
   1>20	| {vfptr}//基类Base2的虚函数指针
   1>24	| _iBase2
   1>	+---
   1>	+--- (virtual base Base3)
   1>28	| {vfptr}//基类Base3的虚函数指针
   1>32	| _iBase3
   1>	+---
   1>Derived::$vftable@Derived@:
   1>		| &Derived_meta
   1>		|  0
   1> 0	| &Derived::g1//派生类自己的虚函数
   1>
   1>Derived::$vbtable@://派生类的虚基表
   1> 0	| -4
   1> 1	| 8 (Derivedd(Derived+4)Base1)
   1> 2	| 16 (Derivedd(Derived+4)Base2)
   1> 3	| 24 (Derivedd(Derived+4)Base3)
   1>
   1>Derived::$vftable@Base1@://基类Base1的虚表
   1>		| -12
   1> 0	| &Derived::f//派生类重写了f
   1> 1	| &Base1::g
   1> 2	| &Base1::h
   1>
   1>Derived::$vftable@Base2@:
   1>		| -20
   1> 0	| &thunk: this-=8; goto Derived::f//指向派生类重写的f
   1> 1	| &Base2::g
   1> 2	| &Base2::h
   1> 
   1>Derived::$vftable@Base3@:
   1>		| -28
   1> 0	| &thunk: this-=16; goto Derived::f//指向派生类重写的f
   1> 1	| &Base3::g
   1> 2	| &Base3::h
       
   //总结:
   // 测试三：多重继承（带虚函数）
   // １、每个基类都有自己的虚函数表
   // ２、派生类如果有自己新增的虚函数，会被加入到第一个虚函数表之中
   // ３、内存布局中，　其基类的布局按照基类被继承时的顺序进行排列
   // ４、派生类会覆盖基类的虚函数，只有第一个虚函数表中存放的是真实的被覆盖的虚函数的地址；
   //     其它的虚函数表中存放的并不是真实的对应的虚函数的地址，而只是一条跳转指令
   ```

9. 钻石继承、B1和B2普通继承B，D继承B1和B2

   ```c++
   class B
   {
   public:
   	B() : _ib(10), _cb('B') {}
   	virtual void f(){cout << "B::f()" << endl;}
   	virtual void Bf(){cout << "B::Bf()" << endl;}
   private:
   	int _ib;
   	char _cb;
   };
   class B1 : /*virtual*/ public B
   {
   public:
   	B1() : _ib1(100), _cb1('1') {}
   	virtual void f(){cout << "B1::f()" << endl;}
   #if 1
   	virtual void f1(){cout << "B1::f1()" << endl;}
   	virtual void Bf1(){cout << "B1::Bf1()" << endl;}
   #endif
   private:
   	int _ib1;
   	char _cb1;
   };
   class B2 : /*virtual*/ public B
   {
   public:
   	B2() : _ib2(1000), _cb2('2') {}
   	virtual void f(){cout << "B2::f()" << endl;}
   #if 1
   	virtual void f2(){cout << "B2::f2()" << endl;}
   	virtual void Bf2(){cout << "B2::Bf2()" << endl;}
   #endif
   private:
   	int _ib2;
   	char _cb2;
   };
   
   class D : public B1, public B2
   {
   public:
   	D() : _id(10000), _cd('3') {}
   	virtual void f(){cout << "D::f()" << endl;}
   #if 1
   	virtual void f1(){cout << "D::f1()" << endl;}
   	virtual void f2(){cout << "D::f2()" << endl;}
   	virtual void Df(){cout << "D::Df()" << endl;}
   #endif
   private:
   	int _id;
   	char _cd;
   };
   ```

   ```c++
   
   ```
   
   
   
10. 钻石继承、B1和B2虚拟继承B，D继承B1和B2

   ```c++
   class B
   {
   public:
   	B() : _ib(10), _cb('B') {}
   	virtual void f(){cout << "B::f()" << endl;}
   	virtual void Bf(){cout << "B::Bf()" << endl;}
   private:
   	int _ib;
   	char _cb;
   };
   class B1 : virtual public B
   {
   public:
   	B1() : _ib1(100), _cb1('1') {}
   	virtual void f(){cout << "B1::f()" << endl;}
   #if 1
   	virtual void f1(){cout << "B1::f1()" << endl;}
   	virtual void Bf1(){cout << "B1::Bf1()" << endl;}
   #endif
   private:
   	int _ib1;
   	char _cb1;
   };
   class B2 : virtual public B
   {
   public:
   	B2() : _ib2(1000), _cb2('2') {}
   	virtual void f(){cout << "B2::f()" << endl;}
   #if 1
   	virtual void f2(){cout << "B2::f2()" << endl;}
   	virtual void Bf2(){cout << "B2::Bf2()" << endl;}
   #endif
   private:
   	int _ib2;
   	char _cb2;
   };
   
   class D : public B1, public B2
   {
   public:
   	D() : _id(10000), _cd('3') {}
   	virtual void f(){cout << "D::f()" << endl;}
   #if 1
   	virtual void f1(){cout << "D::f1()" << endl;}
   	virtual void f2(){cout << "D::f2()" << endl;}
   	virtual void Df(){cout << "D::Df()" << endl;}
   #endif
   private:
   	int _id;
   	char _cd;
   };
   ```

   ```c++
   2>class D	size(52)://4个char(4字节对齐，等价于共16个字节)、4个int、3个虚函数指针、2个虚基指针，共占52字节
   2>	+---
   2> 0	| +--- (base class B1)//基类B1
   2> 0	| | {vfptr}//B1的虚函数指针
   2> 4	| | {vbptr}//B1的虚基指针
   2> 8	| | _ib1
   2>12	| | _cb1
   2>  	| | <alignment member> (size=3)
   2>	| +---
   2>16	| +--- (base class B2)//基类B2
   2>16	| | {vfptr}//B2的虚函数指针
   2>20	| | {vbptr}//B2的虚基指针
   2>24	| | _ib2
   2>28	| | _cb2
   2>  	| | <alignment member> (size=3)
   2>	| +---
   2>32	| _id
   2>36	| _cd
   2>  	| <alignment member> (size=3)
   2>	+---
   2>	+--- (virtual base B)//继承自B1和B2虚基类
   2>40	| {vfptr}//B的虚函数指针
   2>44	| _ib
   2>48	| _cb
   2>  	| <alignment member> (size=3)
   2>	+---
   2>
   2>D::$vftable@B1@://B1的虚表
   2>		| &D_meta
   2>		|  0
   2> 0	| &D::f1//派生类D重写了f1
   2> 1	| &B1::Bf1//基类B1的虚函数，未被覆盖
   2> 2	| &D::Df//派生类D自己的虚函数Df(派生类的虚函数在存储空间上面)
   2>
   2>D::$vftable@B2@://B2的虚表
   2>		| -16
   2> 0	| &D::f2//派生类D重写了f2
   2> 1	| &B2::Bf2//基类B2的虚函数，未被覆盖
   2>
   2>D::$vbtable@B1@://B1的虚基表
   2> 0	| -4
   2> 1	| 36 (Dd(B1+4)B)//指向虚基类B
   2>
   2>D::$vbtable@B2@://B2的虚基表
   2> 0	| -4
   2> 1	| 20 (Dd(B2+4)B)//指向虚基类B(与B1的虚基表中的虚基类位同一个)
   2>
   2>D::$vftable@B@://B的虚表
   2>		| -40
   2> 0	| &D::f//派生类D重写了f
   2> 1	| &B::Bf//基类B的虚函数，未被覆盖
   2>
   //总结:
   // 测试四：钻石型虚继承
   //虚基指针所指向的虚基表的内容：
   //	1. 虚基指针的第一条内容表示的是该虚基指针距离所在的子对象的首地址的偏移
   //	2. 虚基指针的第二条内容表示的是该虚基指针距离虚基类子对象的首地址的偏移
   ```

   